Repository: loginom/admin-guide-l10n
Catalog: omegat/project_save.tmx
Source language: ru
Languages: en

source: Параметры Loginom Studio
en: Loginom Studio Parameters

source: Параметры web-сервера Apache Httpd
en: Apache Httpd Web Server Parameters

source: Параметры журналирования задаются в элементе configuration/log.
en: The logging parameters must be specified in the configuration/log element.

source: Параметры журналирования хранятся в xml файле Logs.cfg.
en: Logging parameters are kept in the XML Logs.cfg file.

source: Параметры записи в базу данных задаются в элементе configuration/log/database:
en: Database record parameters are specified in the configuration/log/database element:

source: Параметры записи в журнал событий Windows задаются в элементе configuration/log/eventLog:
en: Windows events log record parameters are specified in the configuration/log/eventLog element:

source: Параметры записи в файл задаются в элементе configuration/log/fileSystem:
en: The file record parameters are specified in the configuration/log/fileSystem element:

source: Параметры записи событий логирования задаются в элементе configuration/log/internal:
en: Parameters of logging events record are specified in the configuration/log/internal element:

source: Параметры каталогов задаются в атрибутах элемента Settings/Directories:
en: The directory parameters are set in the attributes of the Settings/Directories element:

source: Параметры настроек методов взаимодействия с внешними сервисами
en: Setting Parameters of Methods of Interaction with the External Services

source: Параметры настроек подключения к внешним сервисам
en: Setting Parameters of Connection to the External Services

source: Параметры общих настроек
en: Parameters of the General Settings

source: Параметры привязок задаются в атрибутах элемента Settings/Bindings:
en: Bindings parameters are set in the attributes of the Settings/Bindings element:

source: Параметры установки
en: Installation Parameters

source: Параметры файлов журналов задаются в атрибутах элемента Logging/File:
en: Parameters of the logging files are set in the attributes of the Logging/File element:

source: Параметры этапа XSLT трансформации запроса
en: Parameters of the XSLT Request Transformation Stage

source: Пароль учетной записи Loginom Server
en: Loginom Server account password

source: Первым этапом преобразования XML запроса может быть XSLT трансформация.
en: The first stage of the XML request transformation can be the XSLT transformation.

source: Перед использованием компонентов платформы программый SP-ключ необходимо активировать, но интернет на компьютере конечного пользователя недоступен.
en: It is required to activate the software SP dongle before usage of the platform components, but without net access on the final user computer.

source: Перед использованием компонентов платформы программый SP-ключ необходимо активировать.
en: It is required to activate SP dongle before usage of the platform components.

source: Перед началом выполнения команды ОС результат предыдущих этапов преобразования представляется в виде файла с именем, указанным в параметре Исходное имя файла запроса, и записывается на диск.
en: Before the OS command execution result of the previous transformation stages is represented as a file with the name specified in The request file source name parameter; then it is recorded to the disc.

source: Перезапускаем IIS
en: IIS is restarted

source: Переопределить значение можно в атрибуте workDir элемента configuration/loginom.
en: It is possible to redefine the value in the workDir attribute of the configuration/loginom element.

source: Перечень (содержание столбца Key) параметров одинаков для подключений ко всем сервисам, и включает в себя следующие параметры:
en: The list of (content of the Key column) parameters is the same for connections to all services, and it includes the following parameters:

source: Персональная аналитика
en: Personal Analytics

source: По окончании времени ожидания при отсутствии ответа от внешнего сервиса формируется исключение.
en: On the expiration of the timeout period, and if there is no response from the external service the exception is formed.

source: По пути в файловой системе, указанному в параметре Путь к сертификату.
en: the path in the file system specified in the Certificate path parameter.

source: По умолчанию 10.
en: By default, 10.

source: По умолчанию 10485760 (10Mb).
en: By default, 10485760 (10 Mb).

source: По умолчанию app.log.
en: By default app.log.

source: По умолчанию используется utf-8.
en: utf-8 is used by default.

source: По умолчанию отключен.
en: Disabled by default.

source: По умолчанию пустая строка.
en: Default blank row.

source: По умолчанию устанавливаются все компоненты.
en: All components are installed by default.

source: По умолчанию установка производится в каталог %ProgramFiles%\BaseGroup\;
en: By default, installation is performed in the %ProgramFiles%\BaseGroup\ directory;

source: Подобная структура предполагает, что внешних сервисов, с которыми работает Адаптер, может быть несколько, и для каждого внешнего сервиса может быть определено несколько методов.
en: Such structure enables the Adapter to work with several external services and several methods can be defined for each external service.

source: Подробнее о применении и настройке данного параметра см.
en: The detailed information on the application and configuration of this parameter is provided in

source: Подробнее о работе параметров см.
en: The detailed information on the application of the parameters is provided in

source: Подробнее об установке и использовании сертификатов см.
en: To learn more about certificates installation and usage refer to

source: Подробное описание см.
en: A detailed description is provided in

source: Получает ответ внешнего веб-сервиса;
en: Receives the response of the external web service

source: Получить WSDL-описание можно в браузере на компьютере с развернутым Адаптером по URL: http://localhost/LoginomAdapter/Service.svc?wsdl.
en: It is possible to get the WSDL description using the computer browser with the deployed Adapter at the following URL: http://localhost/LoginomAdapter/Service.svc?wsdl.

source: Пользователю доступны несколько вариантов исполнения физического ключа.
en: Several physical dongle versions are avilable to users.

source: Поместить содержимое каталога Integrator в требуемое расположение
en: To place the Integrator directory content to the required location

source: Помимо предустановленных в процессе инсталляции папок и файлов, в процессе настройки Адаптера в каталоге установки могут быть размещены дополнительные файлы (сертификаты, XSD-схемы и т.п.), необходимые для работы с внешними сервисами.
en: Apart from the folders and files pre-installed in the installation process when configuring the Adapter, additional files, (certificates, the XSD schemas, etc.) required for work with the external services, can be placed into the installation directory.

source: Порт Loginom Server
en: Loginom Server port

source: Порт websocket secure сервера Loginom
en: The websocket secure port of the Loginom server

source: Порт websocket сервера Loginom
en: The websocket port of the Loginom server

source: Порт привязки сайта IIS
en: IIS site binding port

source: Порт сервера Loginom
en: The Loginom server port

source: Поскольку параметр используется в качестве составной части имен (name) элементов и атрибутов WSDL-описания, значение параметра подчиняется правилам именования элементов XML в соответствии со спецификацией W3C.
en: As the parameter is used as a part of the names (name) of items and attributes of the WSDL description, the parameter value is subject to the naming rules of the XML elements under W3C specification.

source: После получения ответного сообщения происходит его дешифрование (при HTTPS-соединении) и выделение содержимого ответа.
en: Upon receipt of the response message, it is decrypted (based on the HTTPS connection) and the response content is selected.

source: После этого в диспетчере служб IIS необходимо удалить размещенный ранее сайт Loginom Adapter, который по умолчанию расположен в группе сайты -> Default Web Site.
en: Then it is required to delete in IIS service manager; the earlier located Loginom Adapter site that is located by default in the sites -> Default Web Site group.

source: После этого появится окно Диспетчера служб IIS, в котором необходимо создать новый пул приложений.
en: Then the IIS service manager window will appear. A new application pool needs to be created in the IIS service manager.

source: После этого программа сгенерирует специальный файл для отправки на сервер активации:
en: Then the program will generate a special file to be sent to the activation server:

source: Последующие запросы к Адаптеру будут выполнены с учетом новых настроек.
en: Subsequent requests to the Adapter will be executed, taking into account the new settings.

source: Практика использования программы показывает, что возможна совместимость с .Net Framework версии 4.5.
en: The evidence from application usage practice shows that compatibility with.Net Framework, version 4.5 is possible.

source: Предыдущая версия при этом будет удалена без сохранения параметров.
en: The earlier version will be removed without saved parameters.

source: Преобразует полученный из сценария Loginom SOAP-запрос к формату запроса внешнего веб-сервиса;
en: Transforms the SOAP request received from the Loginom workflow to the request format of the external web service

source: Преобразует полученный ответ и в формате SOAP возвращает его сценарию Loginom.
en: Transforms the received response and returns it to the Loginom workflow in the SOAP format

source: При взаимодействии с внешними сервисами Адаптер использует только POST-запросы, GET-запросы не используются.
en: While interacting with the external services the Adapter uses only the POST requests. The GET requests are not used.

source: При выборе данного параметра нужно учитывать, что пользователь должен иметь право на чтение и запись в папку для лог-файлов.
en: When selecting this parameter, it is required to take into account that the user must be entitled to read and write to the folder for log files.

source: При заполнении секций HTTP/HTTPS пакета, отправляемого внешнему сервису, также используются следующие параметры Конфигуратора:
en: While filling in the HTTP/HTTPS package sections sent to the external service, the following parameters of the Configurator are also used:

source: При значении "0" количество файлов не ограничено.
en: In the case of "0" value number of files is not limited.

source: При значении true задействуется алгоритм преобразования ответа БКИ «НБКИ», в котором из XML ответа сервиса удаляется подпись сертификатом.
en: In the case of the true value, the algorithm of the response transformation of credit reference bureau "UNITED CREDIT BUREAU", in which the certificate signature is removed from the XML service response is applied.

source: При использовании сервера сетевых ключей требуется создать файл GnClient.ini в каталоге "C:\ProgramData\BaseGroup\Loginom 6\Personal"
en: To use network dongles server, it is required to create the GnClient.ini file in the "C:\ProgramData\BaseGroup\Loginom 6\Personal" directory

source: При использовании сервера сетевых ключей требуется создать файл GnClient.ini в каталоге "C:\ProgramData\BaseGroup\Loginom 6\Server"
en: To use the network dongles server, it is required to create the GnClient.ini file in the "C:\ProgramData\BaseGroup\Loginom 6\Server" directory

source: При использовании сетевых ключей Guardant — на TCP/UDP порты 3186 и 3187 хоста сервера сетевых ключей.
en: Using the network Guardant dongles — to TCP/UDP ports 3186 and 3187 host of the network dongles server.

source: При использовании хранилища необходимо выполнение следующих условий:
en: When using the store, it is required to meet the following conditions:

source: При недоступности в момент активации SP-ключа сети интернет (online-режим) для компьютера конечного пользователя существует возможность активации в offline-режиме.
en: Activation is possible in the offline mode in the case of network unavailability (online-mode) for the final user computer at the moment of SP dongle activation.

source: При обновлении сертификата в хранилище необходимо заново экспортировать новый сертификат из хранилища и обновить путь в параметре Путь к сертификату.
en: While updating the store certificate, it is required to export the new certificate from the store once again, and to update the path in the Certificate path parameter.

source: При обращении к веб-сервису из сети можно использовать URL: http://<ip-адрес>/LoginomAdapter/Service.svc?wsdl , где <ip-адрес> - это ip-адрес компьютера с развернутым Адаптером.
en: When referring to the web service from the network, it is possible to use the following URL: http://<ip address>/LoginomAdapter/Service.svc?wsdl where <ip address> - is the computer IP address with the deployed Adapter.

source: При отсутствии полного пути файлы будут располагаться в папке с Web.config.
en: The files will be placed into the folder with Web.config in the case of full path absence.

source: При получении ответа от внешнего сервиса последовательность этапов преобразования становится обратной.
en: In the case of a response receipt from the external service, the succession of the transformation stages is reverse.

source: При поступлении запроса сервер выбирается случайным образом среди доступных основных (не резервных) серверов, предоставляющих требуемый пакет.
en: Upon the request receipt, the server is randomly selected among the available primary (not standby) servers providing the required package.

source: При сохранении настроек Конфигуратор перезаписывает файл Web.config.
en: When saving the settings, the Configurator rewrites the Web.config file.

source: При успешном запуске в окне консоли появится надпись Служба "LoginomServer" успешно запущена.
en: When the start is successful, the following text will appear in the console window: The "LoginomServer" service was started successfully.

source: При установке в Loginom Server создаются учетные записи пользователей:
en: When the Loginom Server is installing, the following user accounts are created:

source: При установке по умолчанию Конфигуратор находится в папке C:\inetpub\wwwroot\LoginomAdapter\Configurator\.
en: When installing by default, the Configurator is in the following folder: C:\inetpub\wwwroot\LoginomAdapter\Configurator\.

source: При установке по умолчанию включена запись в файл с уровнем детализации Info, журналы пишутся в каталог %ALLUSERSPROFILE%\BaseGroup\Loginom 6\Integrator\Logs\.
en: In the case of the default setup, file record with the Info detailing level is enabled, logs are recorded in the %ALLUSERSPROFILE%\BaseGroup\Loginom 6\Integrator\Logs\ directory.

source: При установке по умолчанию работа Loginom Studio осуществляется через web-сервер Apache.
en: The default installation setting for the Loginom Studio is through use of the Apache web server.

source: При установке продукта в меню "Пуск" Windows (Все программы\Loginom 6\Server) добавляются ярлыки "Запуск сервера Loginom" и "Запуск веб-сервера".
en: When installing the product in the "Start" Windows menu (All programs\Loginom 6\Server), the "Loginom server start" and "Web server start" shortcuts are added.

source: При установке продукта для этих URL в меню "Пуск" Windows Все программы\Loginom 6\Integrator добавляются ярлыки "Описание WSDL сервиса" и "Описание REST сервиса".
en: When installing the product for these URL in the "Start" menu Windows All programs\Loginom 6\Integrator the following shortcuts are added: the "WSDL service description" and "REST service description".

source: При этом запросы, полученные Адаптером до этого, будут завершены со старыми настройками.
en: Requests previously received by the Adapter will be completed with the old settings.

source: При этом, помимо прочего, происходит проверка введенного серийного номера, а также перешифрование файла софтверного ключа с использованием контрольных значений комплектующих компьютера.
en: In this respect, among other issues, the entered serial number is checked, and superencryption of the software dongle file is performed using control values of the computer components.

source: Привязка к полям таблицы
en: Binding to the table fields

source: Привязка программного обеспечения осуществляется не к параметрам компьютера, а только к ключу;
en: Software is bound not to the computer parameters, but to the dongle.

source: Применение Loginom Integrator позволяет реализовать архитектуру решения, обеспечивающую отказоустойчивость, балансировку нагрузки и горизонтальное масштабирование.
en: The Loginom Integrator usage allows for implementation of the solution architecture providing resilience, load balance and scaling out.

source: Применяется только для SOAP-сервисов.
en: It is used only for the SOAP services.

source: Пример HTTP/HTTPS пакета запроса к SOAP-сервису:
en: Example of the HTTP/HTTPS request package to the SOAP service:

source: Пример SOAP-пакета приведен ниже:
en: The SOAP package example is provided below:

source: Пример импорта XSD-схемы описания сервиса в разделе WSDL <wsdl:types> и описания форматов сообщений на основе импортированной схемы в узлах <wsdl:message>:
en: Here is an example of the XSD schema import of the service description in the <wsdl:types> WSDL section and descriptions of the message formats based on the imported schema in the <wsdl:message> nodes:

source: Пример команды:
en: The command example:

source: Пример: http://localhost/lgi/service.svc?wsdl
en: Example: http://localhost/lgi/service.svc?wsdl

source: Принципы работы и настройки
en: Operation Principles and Settings

source: Проверка работоспособности
en: Function Test

source: Проверьте настройки Интернет-соединения и нажмите на кнопку "Далее":
en: Check the Internet connections settings and press the "Next" button:

source: Продление времени действия временных ограничений
en: Extension of the time limits

source: Процедура обновления электронного usb-ключа может потребоваться в следующих случаях:
en: Procedure of USB dongle upgrade is required in the following cases:

source: Процедура получения сертификата и порядок его использования для каждого из внешних веб-сервисов (например - БКИ) описывается в документации, предоставляемой поставщиком услуг соответствующего веб-сервиса.
en: The procedure of the certificate receipt and usage for each external web service (for example, CRB) is described in the documents provided by the service provider of the corresponding web service.

source: Процессор
en: Processor

source: Пулы приложений
en: Application Pools

source: Пустое значение параметра равносильно false.
en: The parameter null value is equal to false.

source: Путь к каталогу по умолчанию - %ALLUSERSPROFILE%\BaseGroup\Loginom 6\Integrator.
en: Default path to the directory - %ALLUSERSPROFILE%\BaseGroup\Loginom 6\Integrator.

source: Путь к ключу SSL
en: Path to the SSL key

source: Путь к сертификату SSL
en: Path to the SSL certificate

source: Путь к схеме задается в параметре Схема, на которую будет ссылаться описание сервиса.
en: The path to the schema is specified in The schema to which the service description will refer the parameter.

source: Работа параметров аналогична команде обработки запросов и описана в разделе Настройка роли клиента внешних сервисов.
en: The parameters application is similar to the request processing command, and it is described in the following section: Configuration of the Client Role of the External Services.

source: Работает более стабильно и надежно;
en: It is distinguished by higher level of stability and reliability.

source: Работает совместно с Loginom Server.
en: It is operated with the Loginom Server.

source: Рабочий каталог
en: Working Directory

source: Рабочий каталог содержит временные данные, требующиеся для работы приложения.
en: The working directory contains the temporary data required for the application operation.

source: Разрешаем подключения к Loginom Server websocket
en: Allow connections to the Loginom Server websocket

source: Разрешаем подключения к Loginom Server для Integrator
en: Allow connections to the Loginom Server for Integrator

source: Разрешаем подключения к http порту web-сервера
en: Allow connections to the http port of the web server

source: Разрешаем подключения к серверу сетевых ключей для Loginom Server
en: Allow connections to the network dongles server for the Loginom Server

source: Расположение рабочего каталога по умолчанию - %AllUsersProfile%\BaseGroup\Loginom 6\Server.
en: The default location of the working directory is %AllUsersProfile%\BaseGroup\Loginom 6\Server.

source: Расположение файла по умолчанию - %ProgramFiles%\BaseGroup\Loginom 6\Integrator.
en: The file is located by default - %ProgramFiles%\BaseGroup\Loginom 6\Integrator.

source: Рекомендуемые
en: Recommended

source: Ручная установка
en: Manual Installation

source: С Loginom Server могут взаимодействовать остальные компоненты платформы, кроме компонента Desktop.
en: Other platform components, with the exception of the Desktop component, can interact with the Loginom Server.

source: С другой стороны, выполняя роль клиента, Адаптер обеспечивает трансформацию этих сообщений из формата SOAP в индивидуальные форматы внешних сервисов и обратно.
en: At the same time, serving as a client, the Adapter provides transformation of these messages from the SOAP format to the individual formats of the external services, and backwards.

source: Самый удобный вариант обновления памяти электронного ключа – это дистанционное программирование памяти ключа при помощи программы GrdTRU.exe.
en: The most convinient way of the electronic dongle memory upgrade is the remote programming of the dongle memory using GrdTRU.exe software.

source: Секции HTTP/HTTPS пакета
en: Sections of the HTTP/HTTPS Package

source: Серверный режим доступен в редакциях Team, Standard и Enterprise.
en: The server mode is available in Team, Standard and Enterprise editions.

source: Серийный номер вида 9XZrwR-XXXXX-7NGDyS-XXXXX-qZGBcW-XXXXX-XoLBXF-xwqwXv-8oEO0o-XXXXX.
en: Serial number of the following type: 9XZrwR-XXXXX-7NGDyS-XXXXX-qZGBcW-XXXXX-XoLBXF-xwqwXv-8oEO0o-XXXXX.

source: Сертификат из хранилища необходимо экспортировать в файл .CER в DER-кодировке X.509 без закрытого ключа, а в параметре настроек Адаптера – Путь к сертификату указывается путь к данному файлу.
en: It is required to export the certificate from the store to the .CER file in the DER coding X.509 without the private key, but in the Adapter settings parameter – the Certificate path - a path to this file is specified.

source: Сертификаты без закрытого ключа могут располагаться отдельным файлом по указанному в параметре Путь к сертификату месте файловой системы.
en: The certificates without a private key can be placed into a separate file in the file system location specified by the Certificate path parameter.

source: Сетевой USB-ключ
en: Network USB Dongle

source: Системные требования
en: System Requirements

source: Скачиваем и устанавливаем модуль ARR3.0
en: It is required to download and install the ARR3.0 module.

source: Скачиваем и устанавливаем модуль URL Rewrite
en: It is required to download and install the URL Rewrite module.

source: Скорректировать содержимое web.config
en: To correct the web.config content

source: Следующая команда добавляет виртуальный каталог /app в сайте Default Web Site:
en: The following command enables addition of the /app virtual directory on the Default Web Site:

source: Следующим этапом может быть преобразование в особый формат сообщения БКИ «ОКБ».
en: The next stage can be transformation to the special message format of the credit reference bureau "UNITED CREDIT BUREAU".
